<script setup>
const navigateParams = {
    nextEl: ".swiper-next",
    prevEl: ".swiper-prev",
};
</script>

<template>
    <section class="reviews">
        <div class="global-title">отзывы</div>
        <div class="reviews__swiper">
            <Swiper :slides-per-view="1" :modules="[SwiperNavigation]" :navigation="navigateParams" :autoplay="{
                delay: 1000,
            }">
                <SwiperSlide>
                    <div class="reviews__card">
                        <div class="reviews__img">
                            <img src="../../assets/img/reviews/img.jpg" alt="">
                        </div>
                        <div class="reviews__content">
                            <p class="reviews__text">
                                Обратился в компанию next level car по поводу подбора нового авто . Были поставлены
                                определенные задачи
                                по поиску автомобиля , комплектация , год пробег машины и так далее .<br><br>
                                Юрием , было предложено много вариантов и на одном из них он прямо настоял . Машина 2020
                                года , полный
                                фарш , пробег минимальный . Мною и компанией был подписан договор на покупку моего нового
                                автомобиля .
                                На всех этапах были предоставлены фото , видео . Было сделано обследование лкп
                                машины. Машиной очень
                                доволен ! Если кто то думает поменять автомобиль , то тогда я рекомендую обратится за
                                помощью к Юрию 🤝
                            </p>
                            <p class="reviews__name"><i>- Иван</i></p>
                        </div>
                    </div>
                </SwiperSlide>
                <SwiperSlide>
                    <div class="reviews__card">
                        <div class="reviews__img">
                            <img src="../../assets/img/reviews/img.jpg" alt="">
                        </div>
                        <div class="reviews__content">
                            <p class="reviews__text">
                                Обратился в компанию next level car по поводу подбора нового авто . Были поставлены
                                определенные задачи
                                по поиску автомобиля , комплектация , год пробег машины и так далее .<br><br>
                                Юрием , было предложено много вариантов и на одном из них он прямо настоял . Машина 2020
                                года , полный
                                фарш , пробег минимальный . Мною и компанией был подписан договор на покупку моего нового
                                автомобиля .
                                На всех этапах были предоставлены фото , видео . Было сделано обследование лкп
                                машины. Машиной очень
                                доволен ! Если кто то думает поменять автомобиль , то тогда я рекомендую обратится за
                                помощью к Юрию 🤝
                            </p>
                            <p class="reviews__name"><i>- Иван</i></p>
                        </div>
                    </div>
                </SwiperSlide>
                <SwiperSlide>
                    <div class="reviews__card">
                        <div class="reviews__img">
                            <img src="../../assets/img/reviews/img.jpg" alt="">
                        </div>
                        <div class="reviews__content">
                            <p class="reviews__text">
                                Обратился в компанию next level car по поводу подбора нового авто . Были поставлены
                                определенные задачи
                                по поиску автомобиля , комплектация , год пробег машины и так далее .<br><br>
                                Юрием , было предложено много вариантов и на одном из них он прямо настоял . Машина 2020
                                года , полный
                                фарш , пробег минимальный . Мною и компанией был подписан договор на покупку моего нового
                                автомобиля .
                                На всех этапах были предоставлены фото , видео . Было сделано обследование лкп
                                машины. Машиной очень
                                доволен ! Если кто то думает поменять автомобиль , то тогда я рекомендую обратится за
                                помощью к Юрию 🤝
                            </p>
                            <p class="reviews__name"><i>- Иван</i></p>
                        </div>
                    </div>
                </SwiperSlide>
                <SwiperSlide>
                    <div class="reviews__card">
                        <div class="reviews__img">
                            <img src="../../assets/img/reviews/img.jpg" alt="">
                        </div>
                        <div class="reviews__content">
                            <p class="reviews__text">
                                Обратился в компанию next level car по поводу подбора нового авто . Были поставлены
                                определенные задачи
                                по поиску автомобиля , комплектация , год пробег машины и так далее .<br><br>
                                Юрием , было предложено много вариантов и на одном из них он прямо настоял . Машина 2020
                                года , полный
                                фарш , пробег минимальный . Мною и компанией был подписан договор на покупку моего нового
                                автомобиля .
                                На всех этапах были предоставлены фото , видео . Было сделано обследование лкп
                                машины. Машиной очень
                                доволен ! Если кто то думает поменять автомобиль , то тогда я рекомендую обратится за
                                помощью к Юрию 🤝
                            </p>
                            <p class="reviews__name"><i>- Иван</i></p>
                        </div>
                    </div>
                </SwiperSlide>
                <SwiperSlide>
                    <div class="reviews__card">
                        <div class="reviews__img">
                            <img src="../../assets/img/reviews/img.jpg" alt="">
                        </div>
                        <div class="reviews__content">
                            <p class="reviews__text">
                                Обратился в компанию next level car по поводу подбора нового авто . Были поставлены
                                определенные задачи
                                по поиску автомобиля , комплектация , год пробег машины и так далее .<br><br>
                                Юрием , было предложено много вариантов и на одном из них он прямо настоял . Машина 2020
                                года , полный
                                фарш , пробег минимальный . Мною и компанией был подписан договор на покупку моего нового
                                автомобиля .
                                На всех этапах были предоставлены фото , видео . Было сделано обследование лкп
                                машины. Машиной очень
                                доволен ! Если кто то думает поменять автомобиль , то тогда я рекомендую обратится за
                                помощью к Юрию 🤝
                            </p>
                            <p class="reviews__name"><i>- Иван</i></p>
                        </div>
                    </div>
                </SwiperSlide>
            </Swiper>
            <div class="swiper-navigate">
                <div class="swiper-prev">
                    <svg width="88" height="88" viewBox="0 0 88 88" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <circle cx="44" cy="44" r="43.5" stroke="#35322E" />
                        <path
                            d="M58.5092 44.7391C58.7045 44.5438 58.7045 44.2272 58.5092 44.0319L55.3273 40.85C55.132 40.6547 54.8154 40.6547 54.6201 40.85C54.4249 41.0452 54.4249 41.3618 54.6201 41.5571L57.4486 44.3855L54.6201 47.2139C54.4249 47.4092 54.4249 47.7258 54.6201 47.921C54.8154 48.1163 55.132 48.1163 55.3273 47.921L58.5092 44.7391ZM29.8906 44.8855H58.1557V43.8855H29.8906V44.8855Z"
                            fill="#35322E" />
                    </svg>
                </div>
                <div class="swiper-next">
                    <svg width="88" height="88" viewBox="0 0 88 88" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <circle cx="44" cy="44" r="43.5" stroke="#35322E" />
                        <path
                            d="M58.5092 44.7391C58.7045 44.5438 58.7045 44.2272 58.5092 44.0319L55.3273 40.85C55.132 40.6547 54.8154 40.6547 54.6201 40.85C54.4249 41.0452 54.4249 41.3618 54.6201 41.5571L57.4486 44.3855L54.6201 47.2139C54.4249 47.4092 54.4249 47.7258 54.6201 47.921C54.8154 48.1163 55.132 48.1163 55.3273 47.921L58.5092 44.7391ZM29.8906 44.8855H58.1557V43.8855H29.8906V44.8855Z"
                            fill="#35322E" />
                    </svg>
                </div>
            </div>
        </div>
    </section>
</template>

<style lang="scss" scoped>
.reviews {
    padding-top: 110px;
    padding-bottom: 133px;
    display: flex;
    flex-direction: column;
    align-items: center;

    &__swiper {
        margin-top: 29px;
        width: 100%;
        max-width: 950px;
    }

    &__card {
        display: flex;
        flex-direction: row;
    }

    &__img {
        border-radius: 14px;
        width: 356px;
        height: unset;
        position: relative;
        z-index: -1;
        left: 20px;

        img {
            border-radius: 14px;
            object-fit: cover;
            height: 100%;
        }
    }

    &__content {
        padding: 28px 33px 30px 29px;
        background: #FFFFFF;
        border-radius: 14px;
    }

    &__name {
        margin-top: 26px;
    }
}

.swiper-navigate {
    display: flex;
    gap: 20px;
    justify-content: flex-end;
    margin: 18px 0 0 0;

    .swiper-prev {
        svg {
            transform: rotate(180deg);
        }
    }

    .swiper-prev,
    .swiper-next {
        cursor: pointer;
    }

    .swiper-button-disabled {
        opacity: 0.24;
        cursor: auto;
    }
}
</style>